## Program to select the rows where the score is missing, i.e. is NaN

In [1]:
import pandas as pd
import numpy as np
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
            'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
            'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

# creating dataframe from given python dictionary and list as index
students_data = pd.DataFrame(exam_data, index=labels)
# finding rows with null values for given column 
null_value_records = pd.isnull(students_data['score'])
students_data[null_value_records]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [2]:
# alternate way for finding rows with null values for given column
null_value_records = pd.isna(students_data['score'])
students_data[null_value_records]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no